app/controllers/genre_controller.rb

SELECT  "genres".* FROM "genres" WHERE "genres"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "stories".* FROM "stories" WHERE "stories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def snippet
    @genre = Genre.find(params[:genre_id])
    puts @genre.inspect
    stories = Story.where("genre_id = ?", @genre.id)