app/controllers/story_controller.rb

  def show
    @genre = Genre.find(params[:genre_id])
    @story = Story.find(params[:story_id])
---
SELECT  "genres".* FROM "genres" WHERE "genres"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "stories".* FROM "stories" WHERE "stories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def new
    @genres = Genre.all
---
SELECT "genres".* FROM "genres"

  def create
    @story = Story.create({title: params[:title], author: params[:author], snippet:params[:snippet], content:params[:content], genre_id:params[:genre]})
---
INSERT INTO "stories" ("author", "title", "content", "snippet", "created_at", "updated_at", "genre_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"