app/controllers/user_controller.rb

  def create
    user = User.new(name: params[:name])
    if user.valid?
      user.save
---
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "nick"], ["created_at", 2017-04-01 20:10:46 UTC], ["updated_at", 2017-04-01 20:10:46 UTC]]